Revit 2027 API
SiteLocation.IsCompatibleWith Method
 Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCompatibleWith(
	SiteLocation otherSiteLocation
)
Public Function IsCompatibleWith (
	otherSiteLocation As SiteLocation
) As Boolean
public:
bool IsCompatibleWith(
	SiteLocation^ otherSiteLocation
)
member IsCompatibleWith :
        otherSiteLocation : SiteLocation -> bool
Parameters
otherSiteLocation SiteLocation
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace